In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
        "name" : ['vishal','patanjali','mukul','aditya'],
        "marks" : [45,46,49,44],
        "city" : ['agra','mathura','jhashi','kashganj']
}

In [3]:
df =pd.DataFrame(dict1)
df

        name  marks      city
0     vishal     45      agra
1  patanjali     46   mathura
2      mukul     49    jhashi
3     aditya     44  kashganj

In [ ]:
# to convert into csv file do this
df.to_csv('friends.csv')

In [9]:
# to remove the index from csv do this
df.to_csv('cheaters.csv',index=False)

In [ ]:
df.head(2) # showes top to rows
df.tail(2) # showes bottem to rows

        name  marks     city
0     vishal     45     agra
1  patanjali     46  mathura

In [8]:
df.describe() # this methord is calculated all mathematical terms like SD,mean,avg...

           marks
count   4.000000
mean   46.000000
std     2.160247
min    44.000000
25%    44.750000
50%    45.500000
75%    46.750000
max    49.000000

In [ ]:
#command for read any csv file in pandas
vishal = pd.read_csv('trains.csv')
vishal

   train_NO.  speed      city
0      12456     45      agra
1      36598     46   mathura
2      85231     49    jhashi
3      15678     44  kashganj

In [14]:
# to select pertecular col.
vishal['speed'][0] =50

C:\Users\vtvis\AppData\Local\Temp\ipykernel_9220\796531971.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  vishal['speed'][0] =50

In [15]:
vishal

   train_NO.  speed      city
0      12456     50      agra
1      36598     46   mathura
2      85231     49    jhashi
3      15678     44  kashganj

In [16]:
# to cahnge the indesis formate
vishal.index = ['first','sec','third','fourth']
vishal

        train_NO.  speed      city
first       12456     50      agra
sec         36598     46   mathura
third       85231     49    jhashi
fourth      15678     44  kashganj